Terraform Plan Output:
```
module.appcd_80d7195c-3aa8-519b-9e54-599eee0b029f.data.aws_caller_identity.current: Reading...
module.appcd_80d7195c-3aa8-519b-9e54-599eee0b029f.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.appcd_0995bb8c-f0cf-55d8-b944-24090b02965e.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "app-function-very-unique-lamda-1407"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "stackgen-builds"
      + s3_key                         = "build/app.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "appstack"  = "hello-kitty-forked"
          + "component" = "app"
        }
      + tags_all                       = {
          + "appstack"  = "hello-kitty-forked"
          + "component" = "app"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "IMAGES_BUCKET" = "something-unique-iguess-1407"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.appcd_0995bb8c-f0cf-55d8-b944-24090b02965e.aws_lambda_function_url.this[0] will be created
  + resource "aws_lambda_function_url" "this" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "app-function-very-unique-lamda-1407"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

  # module.appcd_5036dab1-6075-5bf7-ba09-5b3c4d74e542.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = {
                  + Action    = "sts:AssumeRole"
                  + Effect    = "Allow"
                  + Principal = {
                      + Service = "lambda.amazonaws.com"
                    }
                }
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-role-very-unique-role-1407"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "appstack"  = "hello-kitty-forked"
          + "component" = "app"
        }
      + tags_all              = {
          + "appstack"  = "hello-kitty-forked"
          + "component" = "app"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.appcd_6dcddd4b-d730-5819-a284-558142c8c3d8.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/app-function-very-unique-cloudwatch-1407"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "appstack"  = "hello-kitty-forked"
          + "component" = "app"
        }
      + tags_all          = {
          + "appstack"  = "hello-kitty-forked"
          + "component" = "app"
        }
    }

  # module.appcd_80d7195c-3aa8-519b-9e54-599eee0b029f.aws_kms_alias.a[0] will be created
  + resource "aws_kms_alias" "a" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3-something-unique-iguess-1407"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.appcd_80d7195c-3aa8-519b-9e54-599eee0b029f.aws_kms_key.custom_s3_kms_key[0] will be created
  + resource "aws_kms_key" "custom_s3_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Custom KMS key for s3 bucket encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.appcd_80d7195c-3aa8-519b-9e54-599eee0b029f.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "something-unique-iguess-1407"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "appstack"  = "hello-kitty-forked"
          + "component" = "app"
        }
      + tags_all                    = {
          + "appstack"  = "hello-kitty-forked"
          + "component" = "app"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.appcd_80d7195c-3aa8-519b-9e54-599eee0b029f.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.appcd_80d7195c-3aa8-519b-9e54-599eee0b029f.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.appcd_80d7195c-3aa8-519b-9e54-599eee0b029f.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.appcd_9b736f75-9ec8-4ddf-b5a7-77765f6e2fbb.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "aws_s3-app-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "app-role-very-unique-role-1407"
    }

  # module.appcd_9e0bcabd-10f4-4398-91c4-7b7c563a47b0.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "Writer"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "app-role-very-unique-role-1407"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_cloudwatch_log_group_aws_lambda_app_function_very_unique_cloudwatch_1407_arn  = (known after apply)
  + aws_cloudwatch_log_group_aws_lambda_app_function_very_unique_cloudwatch_1407_name = "/aws/lambda/app-function-very-unique-cloudwatch-1407"
  + aws_iam_role_app_role_very_unique_role_1407_arn                                   = (known after apply)
  + aws_iam_role_app_role_very_unique_role_1407_name                                  = "app-role-very-unique-role-1407"
  + aws_lambda_app_function_very_unique_lamda_1407_function_arn                       = (known after apply)
  + aws_lambda_app_function_very_unique_lamda_1407_function_name                      = "app-function-very-unique-lamda-1407"
  + aws_lambda_app_function_very_unique_lamda_1407_function_url                       = (known after apply)
  + aws_lambda_app_function_very_unique_lamda_1407_invoke_arn                         = (known after apply)
  + aws_s3_something_unique_iguess_1407_arn                                           = (known after apply)
  + aws_s3_something_unique_iguess_1407_bucket_name                                   = (known after apply)
  + aws_s3_something_unique_iguess_1407_kms_arn                                       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```